Revit 2026 API

# ReloadSwapOutInfo Properties

---

The ReloadSwapOutInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentVersion | New version. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Part | The ElementId of part being swapped. |
|  | PreviousVersion | Previous version. |
|  | WasSwapped | Whether the swap out was successful. |

#### Reference

ReloadSwapOutInfo Class

Autodesk.Revit.DB Namespace